app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams"
---
  def league
    @league = Team.all

SELECT "teams".* FROM "teams" WHERE "teams"."conference" = ?  [["conference", "Eastern"]]
---
  def eastern_conf
    @eastern_conf = Team.where(conference: "Eastern")

SELECT "teams".* FROM "teams" WHERE "teams"."conference" = ?  [["conference", "Western"]]
---
  def western_conf
    @western_conf = Team.where(conference: "Western")